{"_id":"5bd2760df1835f0004690d4e","user":{"provider":"google","id":"109848575500257466402","displayName":"Cody Haas","name":{"familyName":"Haas","givenName":"Cody"},"emails":[{"value":"codymhaas@gmail.com","type":"account"}],"photos":[{"value":"https://lh3.googleusercontent.com/-iqah4psbsgw/AAAAAAAAAAI/AAAAAAAAATo/O1gJXU1_5pI/photo.jpg?sz=50"}],"gender":"male"},"spells":[{"slotted":[{"level":0,"prepared":0,"cast":0,"name":"Prestidigitation","school":"Universal","subschool":""},{"level":0,"prepared":0,"cast":0,"name":"Detect Magic","school":"Divination","subschool":""},{"level":0,"prepared":0,"cast":0,"name":"Mage Hand","school":"Transmutation","subschool":""},{"level":0,"prepared":0,"cast":0,"name":"Message","school":"Transmutation","subschool":""},{"level":0,"prepared":0,"cast":0,"name":"Spark","school":"Evocation","subschool":""}]},{"slotted":[{"level":1,"prepared":0,"cast":0,"name":"Charm Person","school":"Enchantment","subschool":"Charm"},{"level":1,"prepared":0,"cast":0,"name":"Cure Light Wounds","school":"Conjuration","subschool":"Healing"},{"level":1,"prepared":0,"cast":0,"name":"Vanish","school":"Illusion","subschool":"Glamer"},{"level":1,"prepared":0,"cast":0,"name":""}]},{},{},{},{},{},{},{},{}],"name":"Nibbles T McGibbles","modified":"2018-11-09T05:36:39.499Z","alignment":"Chaotic Neutral","level":"Bard Level 2","race":"Gnome","size":"Small","gender":"Male","age":"44","height":"3'2","weight":"44","hair":"Brown","eyes":"Blue","abilities":{"str":"6","dex":"12","con":"14","int":"14","wis":"11","cha":"22"},"hp":{"total":"16"},"saves":{"reflex":{"base":"3","total":"4"},"will":{"base":"3","total":"3","otherModifiers":"(DC 10 + 1/2 the bard’s level + the bard’s Cha modifier)"},"fort":{"total":"2"}},"cmd":{"sizeModifier":"-1","total":"8"},"initiative":{"total":"1"},"speed":{"base":"2o"},"bab":"0","cmb":{"sizeModifier":"-1","total":"-3"},"ac":{"sizeModifier":"+1","naturalArmor":"0","deflectionModifier":"0","shieldBonus":"0","armorBonus":"0","total":"13","miscModifier":"+1"},"melee":[{"weapon":"Rapier","damage":"1d4","critical":"x2","type":"M"},{},{},{},{}],"skills":{"acrobatics":{"classSkill":true,"ranks":"+1","total":"5"},"appraise":{"classSkill":true,"ranks":"0","total":"+2"},"bluff":{"classSkill":true,"ranks":"+2","total":"+11"},"climb":{"classSkill":true,"ranks":"0","total":"-2"},"craft1":{"classSkill":true,"ranks":"0","total":"+2"},"craft2":{"classSkill":true,"ranks":"0","total":"+2"},"craft3":{"classSkill":true,"ranks":"0","total":"+2"},"diplomacy":{"classSkill":true,"ranks":"+2","total":"+11"},"disguise":{"classSkill":true,"total":"+10","ranks":"+1"},"escapeArtist":{"classSkill":true,"total":"+1","ranks":"0"},"intimidate":{"classSkill":true,"total":"+6","ranks":"0"},"knowledgeArcana":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeDungeoneering":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeEngineering":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeGeography":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeHistory":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeLocal":{"classSkill":true,"misc":"+1","ranks":"+1","total":"+3"},"knowledgeNature":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeNobility":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgePlanes":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"knowledgeReligion":{"classSkill":true,"misc":"+1","ranks":"0","total":"+3"},"linguistics":{"classSkill":true,"ranks":"+2","total":"+7"},"perception":{"classSkill":true,"ranks":"+2","total":"+7","racial":"+2"},"perform1":{"classSkill":true,"name":"Buffoonery","ranks":"+1","total":"+10"},"perform2":{"classSkill":true,"name":"String Lute","ranks":"+1","total":"+10"},"profession1":{"classSkill":true,"total":"+0","ranks":"+0"},"profession2":{"classSkill":true,"total":"+0","ranks":"+0"},"senseMotive":{"classSkill":true,"total":"+0","ranks":"+0"},"sleightOfHand":{"classSkill":true,"ranks":"+1","total":"+5"},"spellcraft":{"classSkill":true,"ranks":"+0","total":"+2"},"stealth":{"classSkill":true,"total":"+9","ranks":"+1","racial":"+4","misc":""},"useMagicDevice":{"classSkill":true,"ranks":"+1","total":"+10"},"disableDevice":{"total":"+1"},"fly":{"total":"+1","ranks":"0"},"handleAnimal":{"total":"+6","ranks":"0"},"heal":{"total":"0","ranks":"0"},"ride":{"ranks":"0","total":"+1"},"survival":{"total":"0"},"swim":{"total":"0"}},"specialAbilities":[{"name":"Counter Song","type":"Su","notes":"At 1st level, a bard learns to counter magic effects that depend on sound (but not spells that have verbal components.) Each round of the countersong he makes a Perform (keyboard, percussion, wind, string, or sing) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by a sonic or language-dependent magical attack may use the bard’s Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform check result proves to be higher. If a creature within range of the countersong is already under the effect of a non-instantaneous sonic or language-dependent magical attack, it gains another saving throw against the effect each round it hears the countersong, but it must use the bard’s Perform skill check result for the save. Countersong does not work on effects that don’t allow saves. Countersong relies on audible components."},{"name":"Distraction","type":"Su","notes":"At 1st level, a bard can use his performance to counter magic effects that depend on sight.\n\n Each round of the Distraction, he makes a Perform (act, comedy, dance, or oratory) skill check. Any creature within 30 feet of the bard (including the bard himself) that is affected by an illusion (pattern) or illusion (figment) magical attack may use the bard’s Perform check result in place of its saving throw if, after the saving throw is rolled, the Perform check result proves to be higher. If a creature within range of the Distraction is already under the effect of a non-instantaneous illusion (pattern) or illusion (figment) magical attack, it gains another saving throw against the effect each round it sees the Distraction, but it must use the bard’s Perform check result for the save. Distraction does not work on effects that don’t allow saves. Distraction relies on visual components."},{"name":"Fascinate","type":"Su","notes":"At 1st level, a bard can use his performance to cause one or more creatures to become fascinated with him. Each creature to be fascinated must be within 90 feet, able to see and hear the bard, and capable of paying attention to him. The bard must also be able to see the creatures affected. The Distraction of a nearby combat or other dangers prevents the ability from working. For every three levels a bard has attained beyond 1st, he can target one additional creature with this ability."},{"name":"Inspire Courage","type":"Su","notes":"A 1st level bard can use his performance to inspire courage in his allies (including himself), bolstering them against fear and improving their combat abilities. To be affected, an ally must be able to perceive the bard’s performance. An affected ally receives a +1 morale bonus on saving throws against charm and fear effects and a +1 competence bonus on attack and weapon damage rolls. At 5th level, and every six bard levels thereafter, this bonus increases by +1, to a maximum of +4 at 17th level. Inspire courage is a mind-affecting ability. inspire courage can use audible or visual components. The bard must choose which component to use when starting his performance."}],"spellLikes":[],"notes":"Languages: Dwarven, Sylvan, Gnome, Common, Goblin, Zefari\n\nGnome Magic: Gnomes add +1 to the DC of any saving throws against illusion spells that they cast. Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—dancing lights, ghost sound, prestidigitation, and speak with animals. The caster level for these effects is equal to the gnome’s level. The DC for these spells is equal to 10 + the spell’s level + the gnome’s Charisma modifier.\n\nKeen Senses: Gnomes receive a +2 racial bonus on Perception checks.\n\nObsessive: Gnomes receive a +2 racial bonus on a Craft or Profession skill of their choice.\n\nDefensive Training: Gnomes gain a +4 dodge bonus to AC against monsters of the giant subtype.\n\nIllusion Resistance: Gnomes gain a +2 racial saving throw bonus against illusion spells and effects.\n\nBard gains a +4 bonus on saving throws made against bardic performance, sonic, and language-dependent effects.\n\nPerform Skill Bonus + Class Skill Bonus + Skill Bonux (Regardless of skill or class skill); used in place of Skill check.\nAct (Bluff, Disguise)                              Comedy (Bluff, Intimidate)******\nDance (Acrobatics, Fly)                         Keyboard Instruments (Diplomacy, Intimidate)\nOratory (Diplomacy, Sense Motive)      Percussion (Handle Animal, Intimidate)\nSing (Bluff, Sense Motive)                     String (Bluff, Diplomacy)******\nWind (Diplomacy, Handle Animal).\n\nBARDIC PERFORMANCE:\n\nAdd +1 to the bard’s total number of bardic performance rounds per day.\n\nA bard is trained to use the Perform skill to create magical effects on those around him, including himself if desired. He can use this ability for a number of rounds per day equal to 4 + his Charisma modifier. At each level after 1st a bard can use bardic performance for 2 additional rounds per day. Each round, the bard can produce any one of the types of bardic performance that he has mastered, as indicated by his level.\n\nStarting a bardic performance is a standard action, but it can be maintained each round as a free action. Changing a bardic performance from one effect to another requires the bard to stop the previous performance and start a new one as a standard action. A bardic performance cannot be disrupted, but it ends immediately if the bard is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. A bard cannot have more than one bardic performance in effect at one time.\n\nAt 7th level, a bard can start a bardic performance as a move action instead of a standard action. At 13th level, a bard can start a bardic performance as a swift action.\n\nEach bardic performance has audible components, visual components, or both.\n\nIf a bardic performance has audible components, the targets must be able to hear the bard for the performance to have any effect, and many such performances are language dependent (as noted in the description). A deaf bard has a 20% chance to fail when attempting to use a bardic performance with an audible component. If he fails this check, the attempt still counts against his daily limit. Deaf creatures are immune to bardic performances with audible components.\n\nIf a bardic performance has a visual component, the targets must have line of sight to the bard for the performance to have any effect. A blind bard has a 50% chance to fail when attempting to use a bardic performance with a visual component. If he fails this check, the attempt still counts against his daily limit. Blind creatures are immune to bardic performances with visual components.\n\n10/9/18 = spells used 2\n\nMagic deer being protected by the druids; Aocki, very expensive pelts. Druids will kill you if you kill them.","languages":"Common, Gnome, Sylvan, Dwarven, Goblin, Zefari","xp":{"total":"3000","toNextLevel":"3300"},"id":"5bd2760df1835f0004690d4e","resourceUrl":"/api/v1/characters/5bd2760df1835f0004690d4e","status":"active","gear":[{"notes":"+2 Charisma","type":"Charisma","name":"Bandana of Charisma"}],"money":{"gp":"150"}}
